### 2. 练习
#### 【练习一】有2张公司的员工信息表，每个公司共有16名员工，共有五个公司，请解决如下问题：
#### (a) 每个公司有多少员工满足如下条件：既出现第一张表，又出现在第二张表。

In [15]:
import numpy as np
import pandas as pd
df1 = pd.read_csv('data/Employee1.csv')
df2 = pd.read_csv('data/Employee2.csv')
#display(df1.query('Company == "A"'))
#display(df2.query('Company == "A"'))
df3 = df1[['Company', 'Name', 'Salary']].merge(df2[['Company', 'Name', 'Salary']], on=['Company', 'Name'], how='inner')
display(df3.head())
df3.groupby('Company')['Name'].agg(lambda x:x.count())

  Company Name  Salary_x  Salary_y
0       A   a1     25819     28133
1       A   a3     21983     16503
2       A   a6     17354     19256
3       B   b1     29223     20716
4       B   b3      5126     16810

Company
A    3
B    4
C    4
D    2
E    3
Name: Name, dtype: int64

#### (b) 将所有不符合(a)中条件的行筛选出来，合并为一张新表，列名与原表一致。

In [10]:
df1[['Company', 'Name']].append(df2[['Company', 'Name']]).drop_duplicates()

   Company Name
0        A   a1
1        A   a3
2        A   a4
3        A   a6
4        A   a7
..     ...  ...
28       D   d8
30       E   e2
31       E   e3
32       E   e6
36       E  e12

[61 rows x 2 columns]

#### (c) 现在需要编制所有80位员工的信息表，对于(b)中的员工要求不变，对于满足(a)条件员工，它们在某个指标的数值，取偏离它所属公司中满足(b)员工的均值数较小的哪一个，例如：P公司在两张表的交集为{p1}，并集扣除交集为{p2,p3,p4}，那么如果后者集合的工资均值为1万元，且p1在表1的工资为13000元，在表2的工资为9000元，那么应该最后取9000元作为p1的工资，最后对于没有信息的员工，利用缺失值填充。

#### 【练习二】有2张课程的分数表（分数随机生成），但专业课（学科基础课、专业必修课、专业选修课）与其他课程混在一起，请解决如下问题：
#### (a) 将两张表分别拆分为专业课与非专业课（结果为四张表）。

In [31]:
df1 = pd.read_csv('data/Course1.csv')
#display(df1.head())
df2 = pd.read_csv('data/Course2.csv')
#display(df2.head())
df1_pro = df1.query('课程类别 in ["学科基础课", "专业必修课", "专业选修课"]')
df1_nopro = df1.query('课程类别 not in ["学科基础课", "专业必修课", "专业选修课"]')
df2_pro = df2.query('课程类别 in ["学科基础课", "专业必修课", "专业选修课"]')
df2_nopro = df2.query('课程类别 not in ["学科基础课", "专业必修课", "专业选修课"]')

#### (b) 将两张专业课的分数表和两张非专业课的分数表分别合并。

In [37]:
df1_pro.append(df2_pro, ignore_index=True).head()
df1_nopro.append(df2_nopro, ignore_index=True).head()

           课程名字     课程类别  学分    分数
0   思想道德修养与法律基础      思政类   3  89.0
1       中国近代史纲要      思政类   3  97.0
2         网球（初）      体育类   1  81.0
3  极端性气候与陆地生态系统  公共任意选修类   2  78.0
4         游泳（初）      体育类   1  75.0

#### (c) 不使用(a)中的步骤，请直接读取两张表合并后拆分。

In [72]:
df_all = df1.append(df2)
df_all_pro = df_all.query('课程类别 in ["学科基础课", "专业必修课", "专业选修课"]').reset_index().drop(columns='index')
df_all_nopro = df_all.query('课程类别 not in ["学科基础课", "专业必修课", "专业选修课"]').reset_index().drop(columns='index')

#### (d) 专业课程中有缺失值吗，如果有的话请在完成(3)的同时，用组内（3种类型的专业课）均值填充缺失值后拆分。

In [81]:
display(df_all_pro['分数'].isnull().any())
def func(sub_df):
    #方法1
    #sub_df['分数'].replace({np.nan:sub_df['分数'].mean()}, inplace=True)
    #方法2
    sub_df['分数'].fillna(sub_df['分数'].mean(), inplace=True)
    return(sub_df)
df_all_pro.groupby('课程类别').apply(func).head()

True

       课程名字   课程类别  学分    分数
0  云计算应用与开发  专业选修课   3  96.0
1      社会计算  专业选修课   3  78.0
2      深度学习  专业选修课   3  75.0
3    人工智能导论  专业必修课   3  84.0
4   数据结构与算法  学科基础课   5  82.0